{
  "\n": 17,
  "\r": 16,
  " ": 0,
  "!": 84,
  "#": 137,
  "$": 114,
  "%": 160,
  "&": 116,
  "(": 60,
  ")": 59,
  "*": 95,
  "+": 138,
  ",": 21,
  "-": 33,
  ".": 25,
  "/": 89,
  "0": 35,
  "1": 31,
  "2": 49,
  "3": 61,
  "4": 65,
  "5": 66,
  "6": 63,
  "7": 64,
  "8": 46,
  "9": 67,
  ":": 71,
  ";": 39,
  "=": 157,
  "?": 79,
  "A": 29,
  "B": 41,
  "C": 36,
  "D": 55,
  "E": 37,
  "F": 53,
  "G": 50,
  "H": 38,
  "I": 28,
  "J": 68,
  "K": 76,
  "L": 47,
  "M": 40,
  "N": 45,
  "O": 42,
  "P": 43,
  "Q": 104,
  "R": 54,
  "S": 32,
  "T": 27,
  "U": 70,
  "V": 69,
  "W": 51,
  "X": 100,
  "Y": 75,
  "Z": 80,
  "[": 73,
  "]": 74,
  "^": 103,
  "_": 34,
  "a": 3,
  "b": 19,
  "c": 12,
  "d": 11,
  "e": 1,
  "f": 14,
  "g": 20,
  "h": 9,
  "i": 6,
  "j": 48,
  "k": 26,
  "l": 10,
  "m": 15,
  "n": 7,
  "o": 4,
  "p": 18,
  "q": 44,
  "r": 8,
  "s": 5,
  "t": 2,
  "u": 13,
  "v": 24,
  "w": 23,
  "x": 30,
  "y": 22,
  "z": 56,
  "{": 120,
  "}": 121,
  "\u00b0": 78,
  "\u00bc": 106,
  "\u00bd": 83,
  "\u00be": 113,
  "\u00c6": 122,
  "\u00c9": 101,
  "\u00e2": 77,
  "\u00e4": 109,
  "\u00e6": 72,
  "\u00e7": 158,
  "\u00e8": 107,
  "\u00e9": 86,
  "\u00ea": 118,
  "\u00ee": 91,
  "\u00ef": 97,
  "\u00f1": 159,
  "\u00f2": 145,
  "\u00f4": 128,
  "\u00f6": 87,
  "\u00f9": 132,
  "\u00fb": 85,
  "\u00fc": 108,
  "\u0153": 96,
  "\u0192": 156,
  "\u03b1": 88,
  "\u03b2": 90,
  "\u03b3": 98,
  "\u03b4": 99,
  "\u03b5": 105,
  "\u03b6": 102,
  "\u03b7": 112,
  "\u03b8": 117,
  "\u03b9": 110,
  "\u03ba": 127,
  "\u03bb": 131,
  "\u03bc": 126,
  "\u03bd": 124,
  "\u03be": 130,
  "\u03bf": 111,
  "\u03c0": 142,
  "\u03c1": 123,
  "\u03c3": 144,
  "\u03c4": 139,
  "\u03c5": 140,
  "\u03c6": 141,
  "\u03c7": 125,
  "\u03c8": 143,
  "\u03c9": 129,
  "\u03ce": 146,
  "\u2014": 62,
  "\u2018": 82,
  "\u2019": 52,
  "\u201c": 58,
  "\u201d": 57,
  "\u2022": 119,
  "\u2032": 92,
  "\u2033": 94,
  "\u2122": 81,
  "\u2153": 115,
  "\u2648": 133,
  "\u2649": 134,
  "\u264a": 147,
  "\u264b": 148,
  "\u264c": 149,
  "\u264d": 150,
  "\u264e": 151,
  "\u264f": 152,
  "\u2650": 153,
  "\u2651": 154,
  "\u2652": 135,
  "\u2653": 155,
  "\ufe0e": 93,
  "\ufeff": 136
}